{"success":1,"query_summary":{"num_reviews":10,"review_score":7,"review_score_desc":"Positive","total_positive":18,"total_negative":0,"total_reviews":18},"reviews":[{"recommendationid":"199121408","author":{"steamid":"76561198173899526","num_games_owned":0,"num_reviews":122,"playtime_forever":240,"playtime_last_two_weeks":0,"playtime_at_review":240,"last_played":1751815905},"language":"english","review":"A fun little platformer with emphasis on time attack.\n\nCasually trying to beat it should take around 5 hours for most people, but beating dev times on every level is a whole other story. If you're looking for a short platformer to speedrun, or just enjoy revisiting levels to find better routes, you'll definitely have a good time.\n\nHowever, levels are unevenly inspired. Some are genuinely fun, but a fair amount lack inspiration and can be annoying, due to either cheap ways of creating difficulty (some parts in the later levels require borderline frame-perfect inputs, which if you ask me, is probably the worst out of many approaches), many leaps of faith being required to find the shortcuts you need to know for getting time medals, or just uncreative design, like the same hard jump being repeated 8 times in a row.\n\nIt's a precision platformer. You expect it to be hard. But a game can be both hard and fun. Fortunately, this doesn't apply to all levels at all. As I said, it's uneven, not bad altogether.\n\nLast but not least, the game has [i]excellent[/i] boss design. It's honestly worth playing just for that.\n\nAlso, rabbit cute.","timestamp_created":1751817288,"timestamp_updated":1751817376,"voted_up":true,"votes_up":0,"votes_funny":0,"weighted_vote_score":0.5,"comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"121827012","author":{"steamid":"76561198016035379","num_games_owned":8123,"num_reviews":12,"playtime_forever":1936,"playtime_last_two_weeks":0,"playtime_at_review":1059,"last_played":1664548708},"language":"english","review":"Rotund Takeoff is a competent precision autohopping platformer for speedrunners and masochists alike. You basically just move left or right and the rotund bunny (Chubbit) jumps a certain height automatically based on the block type it lands on. There are also some extra gimmicks as you progress, like float zones and enemies with predetermined pathing. The game is easy to learn but hard to master, especially if you are going for the elusive flag time thresholds (you can see the next time target by pressing up 3 times in the results screen).\n\nThe levels are spread across 5 worlds in the lively overworld map; 7 in each are basic reach the goal endeavors, 1 is a boss fight, 1 is an optional world speedrun that includes the 7 levels + boss in it and 1 is a bonus collectathon level (the bonus level is switched with a dastardly but short precision level in the 5th world though). So there are 50 challenges you can conquer in the game, some being mandatory and some optional. The level designs are mostly fun and varied but there are a few stinkers in the mix too. Also some general design choices are questionable, like the spiky balls having a variable hitbox with their spinning animation. Still enough of the game is a blast to play and the audiovisual department really brings it to life, making it an easy recommendation for the target audience.","timestamp_created":1662456157,"timestamp_updated":1662456562,"voted_up":true,"votes_up":9,"votes_funny":1,"weighted_vote_score":"0.645546078681945801","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"121815576","author":{"steamid":"76561198035100973","num_games_owned":465,"num_reviews":792,"playtime_forever":2580,"playtime_last_two_weeks":0,"playtime_at_review":359,"last_played":1663029998},"language":"english","review":"Quick score: 5/5\n\nNotes: Quality platformer all around. \n\nIf you like what you see in the trailer just buy it, you won't regret it. Well, unless you are a completionist, in which case god help you lol. As far as speedrunning goes, this is one of the most difficult platformers on steam to 100%, which is shocking considering how cute and simplistic the game is on the surface. If you are extremely skilled at platforming games you might be able to 100% it in 30 hours at best if you use a guide.\n\nGame is fine for a casual playthrough, so if you aren't super into speedrunning no reason to avoid the game entirely. But if you are someone who enjoys challenging games, this is the game for you.\n\nIt took me about 35 hours, using mostly other peoples guides/routes, to get 100% completion.","timestamp_created":1662429571,"timestamp_updated":1663030976,"voted_up":true,"votes_up":3,"votes_funny":0,"weighted_vote_score":"0.556650280952453613","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"85176435","author":{"steamid":"76561198077624633","num_games_owned":7897,"num_reviews":282,"playtime_forever":215,"playtime_last_two_weeks":0,"playtime_at_review":215,"last_played":1611176779},"language":"french","review":"The gameplay of this game simply consists of pressing right or left in addition to the jump but the game requires precision and mastery which makes it rather difficult during certain phases.","timestamp_created":1611366813,"timestamp_updated":1611367171,"voted_up":true,"votes_up":4,"votes_funny":0,"weighted_vote_score":"0.550682127475738525","comment_count":0,"steam_purchase":false,"received_for_free":true,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"121995675","author":{"steamid":"76561198029925667","num_games_owned":3545,"num_reviews":212,"playtime_forever":397,"playtime_last_two_weeks":0,"playtime_at_review":353,"last_played":1662763226},"language":"english","review":"Wonderfully cute IL platformer that becomes a decent challenge as you progress. It's not as good as the sequel, Rotund Rebound, but it's a solid game well worth your time!\n\nCheck out https://store.steampowered.com/curator/41559946 for more recommendations!","timestamp_created":1662754704,"timestamp_updated":1662754704,"voted_up":true,"votes_up":2,"votes_funny":0,"weighted_vote_score":"0.548542320728302002","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"121755259","author":{"steamid":"76561198820150970","num_games_owned":147,"num_reviews":41,"playtime_forever":896,"playtime_last_two_weeks":0,"playtime_at_review":121,"last_played":1667535939},"language":"english","review":"This game is better quality than more than 75% of the dog S***t that gets released and upvoted because of boobs. Play this game. Its awesome.","timestamp_created":1662324868,"timestamp_updated":1662324868,"voted_up":true,"votes_up":1,"votes_funny":0,"weighted_vote_score":"0.529220819473266602","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"178425137","author":{"steamid":"76561199134145989","num_games_owned":163,"num_reviews":5,"playtime_forever":461,"playtime_last_two_weeks":0,"playtime_at_review":461,"last_played":1730738443},"language":"english","review":"Usually I am not the biggest fan of precision platformers, but somehow this one clicked for me. Controls are simple, levels for the most part are well designed and challenging, (with some frustrating ones in between, looking at you World 4 and some of 5) and going for some gold medals is really satisfying once ya get the stage layout down. Only major gripe is with the bosses, World 3's and the final boss are a bit rough sometimes. Other than that, I don't really have much to say. It's actually pretty good for a remake of a Wii U eShop game. I like it.","timestamp_created":1730781066,"timestamp_updated":1730781066,"voted_up":true,"votes_up":1,"votes_funny":0,"weighted_vote_score":"0.525862038135528564","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"85128518","author":{"steamid":"76561198234066712","num_games_owned":0,"num_reviews":16,"playtime_forever":415,"playtime_last_two_weeks":0,"playtime_at_review":268,"last_played":1630772808},"language":"english","review":"When you first check out Rotund Takeoff, you're probably going to think it's some kind of platformer.  It both is and isn't.  If I had to classify it, it's closer to a very unconventional and challenging hybrid between a racing game and a puzzle game, because the point of the thing is to figure out shortcuts in order to get faster times rather than to just survive to the end of the stage.  \n\nYou will die a lot, but again, that is the point.  You can't take it slowly and carefully if you want to get through to the end.  You need to play with bold and reckless confidence and hurl this fat rabbit forward with zero regard whatsoever for its safety.  Respawning is quick and painless and doesn't disrupt the flow of gameplay at all, and there doesn't seem to be any benefit to making it through any of the stages without dying once.  Controls are very easy and intuitive and the entire game is playable with one hand (both WASD and arrow keys work).  The music and graphics are fine.  I would definitely recommend this game to speedrunners and the kind of gamers who prioritize things like high scores and fast times.  This gameplay concept is pretty brilliant, actually.  Give it a shot.","timestamp_created":1611299834,"timestamp_updated":1611299834,"voted_up":true,"votes_up":1,"votes_funny":0,"weighted_vote_score":"0.525862038135528564","comment_count":0,"steam_purchase":false,"received_for_free":true,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"100562757","author":{"steamid":"76561199100463542","num_games_owned":0,"num_reviews":25,"playtime_forever":6042,"playtime_last_two_weeks":0,"playtime_at_review":4780,"last_played":1745900404},"language":"english","review":"This is coming from someone who's played so much of the original game that this is a remake of, but I love this game. Amazing gameplay and concept, great visuals, an incredible soundtrack, and so much replay value with the emphasis on speedrunning. If you like platformers that can get very challenging, this is a must-play. I genuinely consider this one of the best games in the platformer genre of all time.","timestamp_created":1633447331,"timestamp_updated":1633447331,"voted_up":true,"votes_up":0,"votes_funny":0,"weighted_vote_score":0.5,"comment_count":0,"steam_purchase":false,"received_for_free":true,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"98868303","author":{"steamid":"76561199074321053","num_games_owned":0,"num_reviews":1,"playtime_forever":731,"playtime_last_two_weeks":0,"playtime_at_review":720,"last_played":1634184971},"language":"english","review":"This game demands precision, accuracy and perfection.  It will test your timing, patience and the strength of your very soul.  It's a very unique game in its classification.  I would put it in the bouncing speedrun platform category.  Simple controls, simple objective, clear graphics--but beware of the obstacles and the clock.  Fun game that will test your will to die in order to advance.  Looking forward to the sequel.  Find out what happens to the evil carrot and give it a try!","timestamp_created":1630906678,"timestamp_updated":1630906678,"voted_up":true,"votes_up":0,"votes_funny":0,"weighted_vote_score":0.5,"comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false}],"cursor":"*"}