{"success":1,"query_summary":{"num_reviews":3,"review_score":0,"review_score_desc":"3 user reviews","total_positive":3,"total_negative":0,"total_reviews":3},"reviews":[{"recommendationid":"39025149","author":{"steamid":"76561198038187253","num_games_owned":360,"num_reviews":9,"playtime_forever":180,"playtime_last_two_weeks":0,"playtime_at_review":180,"last_played":1515011693},"language":"english","review":"Found this game during the winter sale, and I think the only way I can properly review it is to split the pros and cons.\n\nPros: It’s got a nice learning curve. You figure out what’s worth moving toward, how to choose your team, what methods to use, and how to stop the “ritual.” Don’t know that I’d quite call it a ritual so much as a boss, but you’ll figure out how to stop it nonetheless. Just a bit of exploring and experimenting. With the stylistic choices, the game is almost relaxing to play. The music is charming, and the whole thing is quite pleasing to look at. The art style is what grabbed my attention in the first place; reminded me of Skyhill, another zombie killer. I think there's a good number of characters to choose from, and I appreciate that there's an equal number of male and female agents rather than just a token female.\n\nCons: I did think it would be a bit more humorous, given the whole “kill zombies in time for tea” premiss. Would’ve been nice to at least have a cut scene or something at the end of the surviving agents drinking tea. My biggest critique of this game is that it’s too short. When I hit the end, I went back to check if it was early access because it seemed like more content could be missing. The game would be worth more praise, replay, and price-wise if there were more than just the one level. The cemetery you see in the previews is the only level. Once you beat it, you’ve beaten the whole game. I really expected more levels, be them different cemeteries, cities, houses, woods, etc. Even if it was approximately the same degree of difficulty and type of gameplay, it could at least be a different layout and a different set of visuals. If the game ever updated with more levels, I would certainly return to it and be much more likely to suggest it to others.\n\nOverall/tl;dr: For the winter sale price, I’d say the game was worth it. I got a couple hours of entertainment out of it before it went stale. (Full price isn’t particularly expensive, but there are other games for that price or less that will entertain you for longer.) The game is good, the visual and audio style choices are great, but the whole thing just needs... more. More game to play. If you have a couple $ laying around, I recommend giving the game a go some time. I'm about 60/40 on recommending it in its present state. But I would recommend it a lot more strongly if it had more content.","timestamp_created":1515013014,"timestamp_updated":1515013014,"voted_up":true,"votes_up":5,"votes_funny":0,"weighted_vote_score":"0.602143228054046631","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"35069535","author":{"steamid":"76561198109268846","num_games_owned":0,"num_reviews":7,"playtime_forever":57,"playtime_last_two_weeks":0,"playtime_at_review":57,"last_played":1505839751},"language":"japanese","review":"邪神の復活を阻止するっぽいゲーム。\n\nゾンビを倒しつつマップにランダムで配置されるなんかダークパワー持ってるっぽい3つの墓を叩いてると中央の泉から封印が解けられたラブクラフト的なタコ（の足）が蘇る。もしかしたらイカ（の足）かもしれない。\n\nつまり世界は滅亡する。\n＠ {な、なんだってー!?\n\nゲーム自体はシンプルな作りで、ドハマりするほどではないがダラダラやるにはいい感じ。\nあと音楽もいいですね。","timestamp_created":1505844160,"timestamp_updated":1505844160,"voted_up":true,"votes_up":1,"votes_funny":0,"weighted_vote_score":"0.502487540245056152","comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false},{"recommendationid":"41143428","author":{"steamid":"76561198295753664","num_games_owned":0,"num_reviews":7,"playtime_forever":150,"playtime_last_two_weeks":0,"playtime_at_review":140,"last_played":1610860580},"language":"english","review":"It is a fun game to play. But it crashes on mac when restarting a scenario. Or, we should say that steam's support for Mac is bad itself.","timestamp_created":1522379442,"timestamp_updated":1522379442,"voted_up":true,"votes_up":0,"votes_funny":0,"weighted_vote_score":0.5,"comment_count":0,"steam_purchase":true,"received_for_free":false,"written_during_early_access":false,"primarily_steam_deck":false}],"cursor":"*"}